DataProcessors/АР17_ЖурналДепозитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР17_ЖурналДепозитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДепозитПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДепозитФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстановленВыбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Акты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/АР_СтатусДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_СтатусДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписанСкан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/АР_ВидыОперацийСчетНаАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_ВидыОперацийСчетНаАренду</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДепозита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/АР17_ЖурналДепозитов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода); //-са
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);

	Если Не ЗначениеЗаполнено(Объект.ВидПериода) Тогда
		Объект.ВидПериода = АР_ОбщиеПроцедуры.ПолучитьВидПериодаПоПериодичности(Константы.АР_ПериодНачисленияАренднойПлаты.Получить());
	КонецЕсли;
	
	//ВыборПериодаКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
	//	ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.День"),
	//	Элементы.ВидПериода.СписокВыбора, Объект.ВидПериода);

	Объект.НачалоПериода = НачалоДня(НачалоМесяца(ТекущаяДата()));
	Объект.ОкончаниеПериода = КонецДня(КонецМесяца(ТекущаяДата()));
	//ЗаполнитьДоговора();
	
КонецПроцедуры

Процедура ЗаполнитьДоговора()
	
	Объект.Договоры.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеДоговораАренды.Ссылка КАК Договор,
	               |	АР17_ЗаключениеДоговораАренды.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеДоговораАренды.ВидДоговора КАК ВидДоговора,
	               |	АР17_ЗаключениеДоговораАренды.Организация КАК Организация,
	               |	АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАренды.СуммаЗалога КАК СуммаЗалога,
	               |	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) КАК ДепозитФакт
	               |ИЗ
	               |	Документ.АР17_ЗаключениеДоговораАренды КАК АР17_ЗаключениеДоговораАренды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |				&НачПериода,
	               |				Счет.Код = ""62.04""
	               |					ИЛИ Счет.Код = ""76.09.1"",
	               |				,
	               |				) КАК ХозрасчетныйОстатки
	               |		ПО (ХозрасчетныйОстатки.Субконто2 = АР17_ЗаключениеДоговораАренды.ДоговорКонтрагента)
	               |ГДЕ
	               |	НЕ АР17_ЗаключениеДоговораАренды.ПометкаУдаления
	               |	И АР17_ЗаключениеДоговораАренды.СтатусДоговора В(&СтатусыДоговора)
	               |	И (АР17_ЗаключениеДоговораАренды.ФактическоеЗакрытие >= &КонПериода
	               |			ИЛИ АР17_ЗаключениеДоговораАренды.ФактическоеЗакрытие = ДАТАВРЕМЯ(1, 1, 1))";
	
	
	Если ЗначениеЗаполнено(Объект.ИК) Тогда
		Запрос.Текст = Запрос.Текст +				   
		"	И АР17_ЗаключениеДоговораАренды.ИК = &ИК";
		Запрос.УстановитьПараметр("ИК", Объект.ИК);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос.Текст = Запрос.Текст +				   
		"	И АР17_ЗаключениеДоговораАренды.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		Запрос.Текст = Запрос.Текст +				   
		"	И АР17_ЗаключениеДоговораАренды.ВидДоговора = &ВидДоговора";
		Запрос.УстановитьПараметр("ВидДоговора", Объект.ВидДоговора);
	Иначе
		ВидДоговора = Новый Массив;
		ВидДоговора.Добавить(Справочники.АР_ВидыДоговоров.Аренда);
		ВидДоговора.Добавить(Справочники.АР_ВидыДоговоров.Субаренда);
		
		Запрос.Текст = Запрос.Текст +				   
		"	И АР17_ЗаключениеДоговораАренды.ВидДоговора В (&ВидДоговора)";
		Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Объект.ОкончаниеПериода));
	СтатусыДоговора = Новый Массив;
	СтатусыДоговора.Добавить(Перечисления.АР_СтатусДоговора.Согласован);
	
	Запрос.УстановитьПараметр("СтатусыДоговора", СтатусыДоговора);
			   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		стр = Объект.Договоры.Добавить();
		Стр.Контрагент = Выборка.Контрагент;
		Стр.Договор = Выборка.Договор;//Выборка.Ссылка;
		Стр.ВидДоговора = Выборка.ВидДоговора;
		Стр.Организация = Выборка.Организация;
		Стр.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
				
		// счета
		ТЗСчета = ПолучитьСчета(Выборка.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
		
		СуммаСчета = ТЗСчета.Итог("СуммаДокумента");
		
		КолвоСчетов = ТЗСчета.Количество();
		Стр.КолСчетов = КолвоСчетов;
		Стр.СуммаСчетов = СуммаСчета;
		
		СуммаДоговора = 0;
		
		ДепозитПлан = Выборка.СуммаЗалога;
		ДепозитФакт = Выборка.ДепозитФакт;
		
		Стр.КолСчетовК = 4;
		
		//Цвета
		//2 синий
		//1 зеленый
		//0 красный
		Если ДепозитПлан <> 0 Тогда
			
			Если ДепозитПлан <= ДепозитФакт Тогда
				Стр.КолСчетовК = 1; //Зеленый
			Иначе
				Если КолвоСчетов = 0 Тогда
					Стр.КолСчетовК = 0; //Красный
				Иначе
					Если СуммаСчета + ДепозитФакт >= ДепозитПлан Тогда // Сумма счета покрывает депозит
						Стр.КолСчетовК = 2; //черный
					Иначе
						Стр.КолСчетовК = 3; //черный
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
		Стр.ДепозитПлан = ДепозитПлан;
		Стр.ДепозитФакт = ДепозитФакт;
		Стр.СуммаРазницы = ДепозитПлан - ДепозитФакт - СуммаСчета;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// + Рогачев  Андрей от 15.08.2016  № 109181
	Если  Элемент.ТекущийЭлемент.Имя="ДоговораДоговорНомер" Тогда
		Если СокрЛП(Элемент.ТекущиеДанные.Договор)<>"" Тогда
			Попытка
				//Элемент.ТекущиеДанные.Договор.ПолучитьФорму().Открыть();
				ПоказатьЗначение(,Элемент.ТекущиеДанные.Договор);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	// - Рогачев  Андрей от 15.08.2016  № 109181
	
	Попытка
		Элемент.ТекущиеДанные[Элемент.ТекущийЭлемент.Имя].ПолучитьФорму().Открыть();
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДоговораПриАктивизацииСтроки(Элемент)
	
	Объект.Счета.Очистить();
	Объект.Акты.Очистить();
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ДанныеСтрокиТаблицы = Новый Структура("ДоговорКонтрагента");
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТаблицы, Элемент.ТекущиеДанные); 
		ДоговораПриАктивизацииСтрокиНаСервере(ДанныеСтрокиТаблицы);
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ДоговораПриАктивизацииСтрокиНаСервере(СтрокаТаблицы)
	
	ТЗСчета = ПолучитьСчета(СтрокаТаблицы.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
	Для Каждого СтрТЗ Из ТЗСчета Цикл	
		стр = Объект.Счета.Добавить();
		Стр.Ссылка = СтрТЗ.Ссылка;
		Стр.Номер = СтрТЗ.Номер;
		Стр.Дата = СтрТЗ.Дата;
		Стр.Контрагент = СтрТЗ.Контрагент;
		Стр.Сумма = СтрТЗ.СуммаДокумента;
	КонецЦикла;
	
	//////////////////////////////////////////////////////////
	
	//ТЗАкты = ПолучитьАкты(СтрокаТаблицы.ДоговорКонтрагента, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.ОкончаниеПериода));
	//Для Каждого СтрТЗ Из ТЗАкты Цикл	
	//	стр = Объект.Акты.Добавить();
	//	Стр.Ссылка = СтрТЗ.Ссылка;
	//	Стр.Номер = СтрТЗ.Номер;
	//	Стр.Дата = СтрТЗ.Дата;
	//	Стр.Контрагент = СтрТЗ.Контрагент;
	//	Стр.Сумма = СтрТЗ.СуммаДокумента;
	//КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСчета(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода)
	
	ЗапросСчета = Новый Запрос;
	ЗапросСчета.Текст = "ВЫБРАТЬ
	                    |	АР17_СчетНаАренду.Ссылка,
	                    |	АР17_СчетНаАренду.Номер,
	                    |	АР17_СчетНаАренду.Дата,
	                    |	АР17_СчетНаАренду.Контрагент,
	                    |	АР17_СчетНаАренду.СуммаДокумента,
	                    |	АР17_СчетНаАренду.ДоговорКонтрагента
	                    |ИЗ
	                    |	Документ.АР17_СчетНаАренду КАК АР17_СчетНаАренду
	                    |ГДЕ
	                    |	АР17_СчетНаАренду.ДоговорКонтрагента = &ДоговорКонтрагента
						|	И НЕ АР17_СчетНаАренду.ПометкаУдаления
						|	И АР17_СчетНаАренду.ВидОперации = &ВидОперации";
					   
					   
	ЗапросСчета.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	ЗапросСчета.УстановитьПараметр("ВидОперации", Перечисления.АР_ВидыОперацийСчетНаАренду.ОплатаДепозита);
	//ЗапросСчета.УстановитьПараметр("НачПериода", НачалоПериода);
	//ЗапросСчета.УстановитьПараметр("КонПериода", ОкончаниеПериода);
	
	Возврат ЗапросСчета.Выполнить().Выгрузить();
	
КонецФункции	

Функция ПолучитьАкты(ДоговорКонтрагента,НачалоПериода,ОкончаниеПериода)
	
	ЗапросАкты = Новый Запрос;
	ЗапросАкты.Текст = "ВЫБРАТЬ
	                   |	АР_НачислениеАренднойПлаты.Ссылка,
	                   |	АР_НачислениеАренднойПлаты.Номер,
	                   |	АР_НачислениеАренднойПлаты.Дата,
	                   |	АР_НачислениеАренднойПлаты.Контрагент КАК Контрагент,
	                   |	АР_НачислениеАренднойПлаты.ДоговорКонтрагента,
	                   |	АР_НачислениеАренднойПлаты.СуммаДокумента
	                   |ИЗ
	                   |	Документ.АР17_НачислениеАренднойПлаты КАК АР_НачислениеАренднойПлаты
	                   |ГДЕ
	                   |	АР_НачислениеАренднойПлаты.ДоговорКонтрагента = &ДоговорКонтрагента
	                   |	И АР_НачислениеАренднойПлаты.НачалоПериода <= &КонПериода
	                   |	И АР_НачислениеАренднойПлаты.ОкончаниеПериода >= &НачПериода";
				   
						
	ЗапросАкты.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	ЗапросАкты.УстановитьПараметр("НачПериода", НачалоПериода);
	ЗапросАкты.УстановитьПараметр("КонПериода", ОкончаниеПериода);
	
	Возврат ЗапросАкты.Выполнить().Выгрузить();
	
КонецФункции	

&НаКлиенте
Процедура СчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
    СсылкаНаДокумент = Элемент.ТекущиеДанные.Ссылка;
	Пар = Новый Структура("Ключ",СсылкаНаДокумент); 
	Форма = ПолучитьФорму("Документ.АР17_СчетНаАренду.Форма.ФормаДокумента",Пар);
    Форма.Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура АктыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
    СсылкаНаДокумент = Элемент.ТекущиеДанные.Ссылка;
	Пар = Новый Структура("Ключ",СсылкаНаДокумент); 
	Форма = ПолучитьФорму("Документ.АР17_НачислениеАренднойПлаты.Форма.ФормаДокумента",Пар);
    Форма.Открыть();
	
КонецПроцедуры

// период
&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	//+са
	//ВыборПериодаКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	АР_ОбщиеПроцедурыКлиент.ПереключитьТекущуюСтраницуВыбораПериода(Объект.ВидПериода, Элементы.ГруппаПоляВводаПериода);
	//-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	Объект.ДатаНачисления = КонецМесяца(Объект.НачалоПериода); //-са
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	ЗаполнитьДоговора();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
		
	ЗаполнитьДоговора();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрганизацияПриИзменении(Элемент)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	ДанныеСохранения = Новый Структура();
	ДанныеСохранения.Вставить("Организация", Объект.Организация);
	ДанныеСохранения.Вставить("ИК", Объект.ИК);
	ДанныеСохранения.Вставить("Период", Период);
	ДанныеСохранения.Вставить("ВидПериода", Объект.ВидПериода);
	ДанныеСохранения.Вставить("НачалоПериода", Объект.НачалоПериода);
	ДанныеСохранения.Вставить("ОкончаниеПериода", Объект.ОкончаниеПериода);
	
	//СохранитьЗначение("АР_ЖурналНачислений", Структура);
	ХранилищеОбщихНастроек.Сохранить("Обработка.АР_ЖурналНачислений.Форма", "ДанныеСохранения", ДанныеСохранения);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Настройки = ХранилищеОбщихНастроек.Загрузить("Обработка.АР_ЖурналНачислений.Форма", "ДанныеСохранения");
    Если Не Настройки = Неопределено И ТипЗнч(Настройки) = Тип("Структура") Тогда
		
		Объект.Организация = Настройки.Организация;
		Объект.ИК = Настройки.ИК;
		Период = Настройки.Период;
		Объект.ВидПериода = Настройки.ВидПериода;
		Объект.НачалоПериода = Настройки.НачалоПериода;
		Объект.ОкончаниеПериода = Настройки.ОкончаниеПериода;
        
	КонецЕсли;
	ЗаполнитьДоговора();
	
КонецПроцедуры

//////////////////////////////////////////////
&НаКлиенте
Процедура СформироватьСчета(Команда)
	
	Пар = Новый Структура;
	
	// + NAI Becar Конюшок С.Н. от 23.01.2017 09:43 групповой отбор
	СписокКА = Новый СписокЗначений;
	СписокДоговоровКА = Новый СписокЗначений;
	Для каждого Стр Из Объект.Договоры Цикл
		Если Стр.УстановленВыбор Тогда
		    СписокКА.Добавить(Стр.Контрагент);
			СписокДоговоровКА.Добавить(ПолучитьДоговор(Стр.Договор));
		КонецЕсли; 
	КонецЦикла; 
	//
		
	// + Рогачев  Андрей от 12.08.2016  № 108740
	//Пар.Вставить("Ссылка", Элементы.Счета.ТекущиеДанные.Ссылка);
	Если  СокрЛП(Элементы.Договора.ТекущиеДанные.Договор) <> "" Тогда
		Пар.Вставить("Ссылка", Элементы.Договора.ТекущиеДанные.Договор);
	КонецЕсли;
	Пар.Вставить("ВидПериода", Объект.ВидПериода);
	Пар.Вставить("НачалоПериода", Объект.НачалоПериода);
	Пар.Вставить("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Пар.Вставить("Период", ЭтаФорма.Период);
	Пар.Вставить("Депозит", Истина);
	Если СписокКА.Количество() > 1 Тогда
	
		Пар.Вставить("СписокКА", СписокКА);
		Пар.Вставить("СписокДоговоровКА", СписокДоговоровКА);
	
	КонецЕсли; 
	
	форма = ПолучитьФорму("Обработка.АР17_ГрупповоеВыставлениеСчетов.Форма.Форма",Пар);
	Если форма.Открыта() Тогда
		Форма.Закрыть();
		форма = ПолучитьФорму("Обработка.АР17_ГрупповоеВыставлениеСчетов.Форма.Форма",Пар);
	 	//форма.Открыть();
	КонецЕсли;
	форма.Открыть();
	
КонецПроцедуры

// + NAI Becar Конюшок С.Н. от 24.01.2017 10:45
&НаСервере   
Функция ПолучитьДоговор(Договор)
	Возврат Договор.ДоговорКонтрагента;
КонецФункции


&НаКлиенте
Процедура СформироватьАкты(Команда)
	
	Пар = Новый Структура;
	// + Рогачев  Андрей от 12.08.2016  № 108740
	//Пар.Вставить("Ссылка", Элементы.Акты.ТекущиеДанные.Ссылка);
	Если   СокрЛП(Элементы.Договора.ТекущиеДанные.Договор)<>""   Тогда
		Пар.Вставить("Ссылка", Элементы.Договора.ТекущиеДанные.Договор);
	КонецЕсли;
	Пар.Вставить("ВидПериода", Объект.ВидПериода);
	Пар.Вставить("НачалоПериода", Объект.НачалоПериода);
	Пар.Вставить("ОкончаниеПериода", Объект.ОкончаниеПериода);
	Пар.Вставить("Период", ЭтаФорма.Период);
	
	форма = ПолучитьФорму("Обработка.АР_ГрупповоеНачислениеАренднойПлаты.Форма.Форма",Пар);
	форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИмущественныйКомплексПриИзменении(Элемент)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСЧетаСразу(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидДоговораПриИзменении(Элемент)
	ЗаполнитьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажок(Команда)
	
	Для каждого Стр Из Объект.Договоры Цикл
		  Стр.УстановленВыбор = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажок(Команда)
	
	Для каждого Стр Из Объект.Договоры Цикл
		Стр.УстановленВыбор = Ложь;
	КонецЦикла;
	
КонецПроцедуры

//
